---
kind: method
id: M:Autodesk.Revit.DB.FabricationItemFile.GetImage
source: html/1895f14b-5c05-e206-9ea5-1593a84491b5.htm
---
# Autodesk.Revit.DB.FabricationItemFile.GetImage Method

Gets the image for the fabrication item file.

## Syntax (C#)
```csharp
public virtual Bitmap GetImage()
```

## Returns
System.Drawing.Bitmap represents the fabrication item file image. Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no preview image.